# Assignment for Week 6      
(Chapter 8 & 9)

## Purpose:     
This assignment is intended to help you do the following:     
1.	Advance your knowledge on working with strings
2.	Familiarize with regular expression
3.	Use of functions and .apply()

## Action Items:       
•	Working with strings.
1. Clean a column on your data set using 
regular expression methods.      
2. Store the cleaned column into another column of your data set and call it “your_col_name_cleaned”.     

  *Another data set will be provided if your data set is not appropriate to apply regular expression methods.        

•	Use of .apply() 

1.   Create a function that returns the mean, sum, mode, median, and range (separately)      
2.   Run the function into your chosen data set using the .apply() method.     
3.   Post your work on GitHub

In [19]:
# Let's get the State Drug Set loaded
import pandas as pd
import re
import seaborn as sns
import numpy as np
import pandas.util.testing as tm
dataset = pd.read_csv('https://raw.githubusercontent.com/frankDATA612/data_612/master/State_Drug_Utilization_Data_2010/State_Drug_Utilization_Data_2010.csv')
dataset.head()

   Unnamed: 0 Utilization Type  ...             Location          NDC
0      128037             MCOU  ...  (31.1801, -91.8749)  37205013705
1      491755             FFSU  ...  (39.3498, -75.5148)  62756076388
2     2568076             FFSU  ...  (44.2853, -99.4632)  46987032311
3      491263             FFSU  ...  (43.3504, -84.5603)    781518501
4      836489             FFSU  ...                  NaN  51552080906

[5 rows x 21 columns]

**Action Item 1 and 2:**

How to use REGEX in Pandas. I am going to use the "extract()" syntax to pull the first 7 characters of each Product Name using ^(start of the string) and {7} (for 7 characters) and then create a new column called "Your_Col_Name_Cleaned".

In [20]:
# Let's pull that 7 Character String and put it into a new Column
dataset['Your_Col_Name_Cleaned'] = dataset['Product Name'].str.extract(r'(^\w{7})')
dataset.head(5)

   Unnamed: 0 Utilization Type  ...          NDC  Your_Col_Name_Cleaned
0      128037             MCOU  ...  37205013705                ARTIFIC
1      491755             FFSU  ...  62756076388                TORSEMI
2     2568076             FFSU  ...  46987032311                    NaN
3      491263             FFSU  ...    781518501                LEVOTHY
4      836489             FFSU  ...  51552080906                    NaN

[5 rows x 22 columns]

In [8]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 156220 entries, 0 to 156219
Data columns (total 22 columns):
 #   Column                          Non-Null Count   Dtype
---  ------                          --------------   -----
 0   Unnamed: 0                      156220 non-null  int64
 1   Utilization Type                156220 non-null  object
 2   State                           156220 non-null  object
 3   Labeler Code                    156220 non-null  int64
 4   Product Code                    156220 non-null  int64
 5   Package Size                    156220 non-null  int64
 6   Year                            156220 non-null  int64
 7   Quarter                         156220 non-null  int64
 8   Product Name                    156166 non-null  object
 9   Units Reimbursed                156220 non-null  float64
 10  Suppression Used                156220 non-null  bool
 11  Number of Prescriptions         156220 non-null  int64
 12  Total Amount Reimbursed         156220 non-null  float64
 13  Medicaid Amount Reimbursed      156220 non-null  float64
 14  Non Medicaid Amount Reimbursed  156220 non-null  float64
 15  Quarter Begin                   156220 non-null  object
 16  Quarter Begin Date              156220 non-null  object
 17  Latitude                        145416 non-null  float64
 18  Longitude                       145416 non-null  float64
 19  Location                        145416 non-null  object
 20  NDC                             156220 non-null  int64
 21  Your_Col_Name_Cleaned           133755 non-null  object
dtypes: bool(1), float64(6), int64(8), object(7)
memory usage: 25.2+ MB

In [22]:
# Next, let's pull a secondary expression out of the dataset. The first two digits of the Utilization Code and place that into a Column called Util_Code_Col_Extract.
dataset['Util_Code_Col_Extract'] = dataset['Utilization Type'].str.extract(r'(^\w{2})')
dataset.head(5)

   Unnamed: 0 Utilization Type  ... Your_Col_Name_Cleaned  Util_Code_Col_Extract
0      128037             MCOU  ...               ARTIFIC                     MC
1      491755             FFSU  ...               TORSEMI                     FF
2     2568076             FFSU  ...                   NaN                     FF
3      491263             FFSU  ...               LEVOTHY                     FF
4      836489             FFSU  ...                   NaN                     FF

[5 rows x 23 columns]

**Action Item 3:**

Use of .apply()
1. Create a function that returns the mean, mode, sum, median, and range (separately).
2. Run the function against your dataset
3. Post your work to GitHub

First let's get rid of all columns that are not numeric or don't have the potential to show good values for mean, mode, median, sum, and range.

In [ ]:
# Make the Drop Column List
to_drop = ['Unnamed: 0', 'Utilization Type', 'State', 'Labeler Code', 'Product Code', 'Year', 'Quarter',
           'Product Name', 'Suppression Used', 'Medicaid Amount Reimbursed', 'Non Medicaid Amount Reimbursed',
           'Quarter Begin', 'Quarter Begin Date', 'Latitude', 'Longitude',
           'Location', 'NDC', 'Your_Col_Name_Cleaned']
dataset.drop(to_drop, inplace=True, axis=1)
dataset.head()

   Package Size  ...  Total Amount Reimbursed
0             5  ...                     4.08
1            88  ...                   103.33
2            11  ...                   905.24
3             1  ...                   312.22
4             6  ...                    52.87

[5 rows x 4 columns]

In [ ]:
# Now let's get the Mean for all the Columns using ".apply()"
moddataset = dataset.apply(lambda x: np.mean(x) if x.name in ['Package Size', 'Units Reimbursed', 'Number of Prescriptions', 'Total Amount Reimbursed'] else x)
print("Mean Function: Columns Not Dropped - Package Size, Units Reimbursed, Number of Prescriptions, and Total Amount Reimbursed:", moddataset, sep='\n')

Mean Function: Columns Not Dropped - Package Size, Units Reimbursed, Number of Prescriptions, and Total Amount Reimbursed:
Package Size                  22.058885
Units Reimbursed           20785.139638
Number of Prescriptions      316.780067
Total Amount Reimbursed    21871.753224
dtype: float64

In [ ]:
# Next, let's see the Median for all the Columns using ".apply()"
moddataset = dataset.apply(lambda x: np.median(x) if x.name in ['Package Size', 'Units Reimbursed', 'Number of Prescriptions', 'Total Amount Reimbursed'] else x)
print("Median Function: Columns Not Dropped - Package Size, Units Reimbursed, Number of Prescriptions, and Total Amount Reimbursed:", moddataset, sep='\n')

Median Function: Columns Not Dropped - Package Size, Units Reimbursed, Number of Prescriptions, and Total Amount Reimbursed:
Package Size                10.00
Units Reimbursed           565.00
Number of Prescriptions     13.00
Total Amount Reimbursed    350.64
dtype: float64

In [ ]:
# Next, let's see the Sum of each of the Columns using ".apply()"
moddataset = dataset.apply(lambda x: np.sum(x) if x.name in ['Package Size', 'Units Reimbursed', 'Number of Prescriptions', 'Total Amount Reimbursed'] else x)
print("Sum Function: Columns Not Dropped - Package Size, Units Reimbursed, Number of Prescriptions, and Total Amount Reimbursed:", moddataset, sep='\n')

Sum Function: Columns Not Dropped - Package Size, Units Reimbursed, Number of Prescriptions, and Total Amount Reimbursed:
Package Size               3.446039e+06
Units Reimbursed           3.247055e+09
Number of Prescriptions    4.948738e+07
Total Amount Reimbursed    3.416805e+09
dtype: float64

In [ ]:
# Let's see the Mode for the modified Dataset
dataset.mode(axis=0)

   Package Size  ...  Total Amount Reimbursed
0             1  ...                      4.0

[1 rows x 4 columns]

In [ ]:
# Let's see the Summary Stats for all the Columns
print(dataset.describe(include='all'))

        Package Size  ...  Total Amount Reimbursed
count  156220.000000  ...             1.562200e+05
mean       22.058885  ...             2.187175e+04
std        26.599697  ...             4.096904e+05
min         0.000000  ...             0.000000e+00
25%         1.000000  ...             6.288000e+01
50%        10.000000  ...             3.506400e+02
75%        32.000000  ...             2.148983e+03
max        99.000000  ...             5.033949e+07

[8 rows x 4 columns]

In [ ]:
# Now let's look at the range of our four Column Modified Dataset
print("\n------------ Minimum ------------\n")
print(dataset[['Package Size', 'Units Reimbursed', 'Number of Prescriptions', 'Total Amount Reimbursed']].min())

print("\n------------ Maximum ------------\n")
print(dataset[['Package Size', 'Units Reimbursed', 'Number of Prescriptions', 'Total Amount Reimbursed']].max())

------------ Minimum ------------

Package Size               0.0
Units Reimbursed           0.0
Number of Prescriptions    1.0
Total Amount Reimbursed    0.0
dtype: float64

------------ Maximum ------------

Package Size                     99.00
Units Reimbursed           60055954.74
Number of Prescriptions      389127.00
Total Amount Reimbursed    50339487.23
dtype: float64

Range function found at:  pythonprogramming.in/find-minimum-and-maximum-value-of-all-columns-from-pandas-dataframe

**Summary:**

Action Item 1 - We pulled two character strings out of the dataset and placed those strings into two different columns with new names.

Next, I generated a drop column list to decease the number of columns that we would be working with for our "function" syntax requirements. It was better to work with four columns of data than 21 columns of data in our dataset.

Action Item 2 - We generated different functions to pull the mean, mode, median, range, and sum separately from our dataset (as seen above).

Action Item 3 - Post the results to GitHub.